app/Controllers/Produtos.php

SELECT *
FROM `produtos`
---
    public function index()
    {
       $data =[//esse array aqui vela esse texto do titulo para o index
            'titulo'=>'Listando os produtos',
            'produtos'=>$this->produtoModel->findAll()